* Penny
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | penny
Alternate name                        | Penny Ice Cap
Data source                           | WIC
Drill year(s)                         | 
Data year(s)                          | 1996
Longitude [°E]                        | -65.2
Latitude [°N]                         | 67.3
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 176
Ice thickness year                    | 
Ice thickness source                  | Data file + WIC email (see also Fisher 1998)
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | T
Depth of top measurement [m]          | 10.0
Depth of bottom measurement [m]       | 176.0
#+end_example

** Temperature

+ Data provided from Liam email: [[mu4e:msgid:AM0PR04MB6129F2DC55EE1ACDB5107ED5A2CC0@AM0PR04MB6129.eurprd04.prod.outlook.com][Penny T profile?]]

#+BEGIN_example
From: William Colgan
To: Ken Mankoff
Subject: Penny T profile?
Date: Wed 09 Dec 2020 03:17:20 AM PST
Attachments: [1]Penny 1996 borehole T profile.xlsx(303.9K)

Hey Ken – Here is the last of the Canadian Arctic Ice Caps. Penny! For the IceTemp database. The 1996 profile is to bedrock.

Penny site:
Latitude           N 67 deg 18'
Longitude        W 65 deg 12'

Fra: Christian Zdanowicz
Sendt: 2. december 2020 13:27
Til: William Colgan
Emne: RE: Prince of Wales - ice temperature?

So here you are (attachments). There were two T profiles measured through Penny ice cap,
one in the 1996 borehole, one in the 1998 borehole. I distrust the 1998 profile, because
it is likely that the termistor got stuck in the borehole, as the constant Ts below 140 m
suggest (see figure in the Excel spreadsheet). The T profile in the 1996 borehole, measured
in 1997, is more trustworthy. See attached paper (JGR 2012) for borehole locations.

David Fisher deserves the credit for all these data, I did not generate them. You can use
his Univ. of Ottawa affiliation: Department of Earth and Environmental Sciences, University
of Ottawa, Ottawa, Canada, K1N 6N5 (dafisher2@sympatico.ca<mailto:dafisher2@sympatico.ca>).
#+END_example


** Thickness

+ From WIC email
 
** Location

+ From WIC email

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS:
|   d |      t |
|  10 | -11.93 |
|  20 | -12.53 |
|  30 | -12.67 |
|  40 | -12.75 |
|  50 | -12.75 |
|  60 |  -12.7 |
|  70 | -12.51 |
|  80 | -12.51 |
|  90 |  -12.5 |
| 100 | -12.48 |
| 120 |  -12.4 |
| 130 | -12.34 |
| 140 | -12.26 |
| 150 | -12.13 |
| 160 | -12.11 |
| 176 | -12.06 |

